Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-internals_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-internals title: Virtual DOM and Internals permalink: docs/faq-internals.html layout: docs category: FAQ ---
ja: --- id: faq-internals title: 仮想 DOM と内部処理 permalink: docs/faq-internals.html layout: docs category: FAQ ---

source: ### What is the Virtual DOM?
ja: ### 仮想 DOM とは？

source: The virtual DOM (VDOM) is a programming concept where an ideal, or "virtual", representation of a UI is kept in memory and synced with the "real" DOM by a library such as ReactDOM. This process is called [reconciliation](/docs/reconciliation.html).
ja: 仮想 DOM (virtual DOM; VDOM) は、インメモリに保持された想像上のまたは「仮想の」UI 表現が、ReactDOM のようなライブラリによって「実際の」DOM と同期されるというプログラミング上の概念です。このプロセスは[差分検出処理 (reconciliation)](/docs/reconciliation.html)と呼ばれます。

source: This approach enables the declarative API of React: You tell React what state you want the UI to be in, and it makes sure the DOM matches that state.
ja: このアプローチにより React の宣言型 API が可能になっています。あなたは UI をどのような状態にしたいのか React に伝え、React は必ず DOM をその状態と一致させます。

source: This abstracts out the attribute manipulation, event handling, and manual DOM updating that you would otherwise have to use to build your app.
ja: これにより、React なしではアプリケーションを構築するために避けて通れない属性の操作やイベントハンドリング、および手動での DOM 更新が抽象化されます。

source: Since "virtual DOM" is more of a pattern than a specific technology, people sometimes say it to mean different things.
ja: "仮想 DOM" は特定の技術というよりむしろ 1 つのパターンなので、時たま違う意味で使われることがあります。

source: In React world, the term "virtual DOM" is usually associated with [React elements](/docs/rendering-elements.html) since they are the objects representing the user interface.
ja: React の世界において "仮想 DOM" という用語は通常、ユーザインタフェースを表現するオブジェクトである [React 要素](/docs/rendering-elements.html) と結びつけて考えられます。

source: React, however, also uses internal objects called "fibers" to hold additional information about the component tree.
ja: React は一方で、コンポーネントツリーに関する追加情報を保持するため "ファイバー (fiber)" と呼ばれる内部オブジェクトも使用します。

source: They may also be considered a part of "virtual DOM" implementation in React.
ja: これらも React における "仮想 DOM" 実装の一部と見なすことができます。

source: ### Is the Shadow DOM the same as the Virtual DOM?
ja: ### Shadow DOM は仮想 DOM と同じもの？

source: No, they are different.
ja: いいえ、違います。

source: The Shadow DOM is a browser technology designed primarily for scoping variables and CSS in web components.
ja: Shadow DOM は、本来 web components において変数や CSS をスコープ化するために設計されたブラウザ技術です。

source: The virtual DOM is a concept implemented by libraries in JavaScript on top of browser APIs.
ja: 仮想 DOM は JavaScript のライブラリによってブラウザ API の上に実装された概念です。

source: ### What is "React Fiber"?
ja: ### 「React Fiber」とは？

source: Fiber is the new reconciliation engine in React 16.
ja: Fiber は React 16 の新しい差分検出処理エンジンです。

source: Its main goal is to enable incremental rendering of the virtual DOM. [Read more](https://github.com/acdlite/react-fiber-architecture).
ja: その主な目的は仮想 DOM の逐次レンダーを可能にすることです。[さらに読む](https://github.com/acdlite/react-fiber-architecture)
